comparison/results_reprod/dsb_other/bench100/compose_orig/out_3_601.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 3 connections
  Thread calibration: mean lat.: 792.467ms, rate sampling interval: 2951ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.43s   544.27ms   3.42s    58.53%
    Req/Sec   507.17      5.34   514.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.28s 
 75.000%    2.94s 
 90.000%    3.16s 
 99.000%    3.42s 
 99.900%    3.51s 
 99.990%    3.54s 
 99.999%    3.55s 
100.000%    3.55s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1373.183     0.000000            1         1.00
    1740.799     0.100000         1015         1.11
    1903.615     0.200000         2027         1.25
    2032.639     0.300000         3041         1.43
    2160.639     0.400000         4063         1.67
    2277.375     0.500000         5067         2.00
    2385.919     0.550000         5568         2.22
    2699.263     0.600000         6081         2.50
    2779.135     0.650000         6594         2.86
    2859.007     0.700000         7088         3.33
    2940.927     0.750000         7599         4.00
    2983.935     0.775000         7858         4.44
    3022.847     0.800000         8110         5.00
    3055.615     0.825000         8352         5.71
    3088.383     0.850000         8615         6.67
    3125.247     0.875000         8862         8.00
    3145.727     0.887500         8991         8.89
    3164.159     0.900000         9116        10.00
    3186.687     0.912500         9246        11.43
    3209.215     0.925000         9379        13.33
    3227.647     0.937500         9497        16.00
    3237.887     0.943750         9554        17.78
    3252.223     0.950000         9624        20.00
    3266.559     0.956250         9692        22.86
    3282.943     0.962500         9748        26.67
    3305.471     0.968750         9807        32.00
    3319.807     0.971875         9841        35.56
    3334.143     0.975000         9873        40.00
    3348.479     0.978125         9902        45.71
    3364.863     0.981250         9934        53.33
    3383.295     0.984375         9968        64.00
    3393.535     0.985938         9985        71.11
    3405.823     0.987500         9999        80.00
    3418.111     0.989062        10014        91.43
    3430.399     0.990625        10030       106.67
    3440.639     0.992188        10045       128.00
    3444.735     0.992969        10052       142.22
    3452.927     0.993750        10060       160.00
    3463.167     0.994531        10071       182.86
    3471.359     0.995313        10076       213.33
    3481.599     0.996094        10084       256.00
    3485.695     0.996484        10089       284.44
    3487.743     0.996875        10092       320.00
    3491.839     0.997266        10096       365.71
    3497.983     0.997656        10102       426.67
    3502.079     0.998047        10105       512.00
    3504.127     0.998242        10106       568.89
    3508.223     0.998437        10109       640.00
    3510.271     0.998633        10110       731.43
    3512.319     0.998828        10112       853.33
    3514.367     0.999023        10114      1024.00
    3520.511     0.999121        10116      1137.78
    3520.511     0.999219        10116      1280.00
    3524.607     0.999316        10118      1462.86
    3524.607     0.999414        10118      1706.67
    3526.655     0.999512        10119      2048.00
    3526.655     0.999561        10119      2275.56
    3532.799     0.999609        10121      2560.00
    3532.799     0.999658        10121      2925.71
    3532.799     0.999707        10121      3413.33
    3532.799     0.999756        10121      4096.00
    3532.799     0.999780        10121      4551.11
    3538.943     0.999805        10122      5120.00
    3538.943     0.999829        10122      5851.43
    3538.943     0.999854        10122      6826.67
    3538.943     0.999878        10122      8192.00
    3538.943     0.999890        10122      9102.22
    3545.087     0.999902        10123     10240.00
    3545.087     1.000000        10123          inf
#[Mean    =     2427.034, StdDeviation   =      544.272]
#[Max     =     3543.040, Total count    =        10123]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15163 requests in 30.00s, 3.11MB read
  Non-2xx or 3xx responses: 12
Requests/sec:    505.39
Transfer/sec:    106.13KB